# •	1 биткойн = 1168 лева.
# •	1 китайски юан = 0.15 долара.
# •	1 долар = 1.76 лева.
# •	1 евро = 1.95 лева.
# Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро.
# Вход
# От конзолата се четат 3 числа:
# •	На първия ред – броят биткойни. Цяло число в интервала [0…20]
# •	На втория ред – броят китайски юана. Реално число в интервала [0.00… 50 000.00]
# •	На третия ред – комисионната. Реално число в интервала [0.00 ... 5.00]


b_count = float(input())
c_count = float(input())
percentage = float(input())

b_price = (b_count * 1168) / 1.95

c_price = ((c_count * 0.15) * 1.76) / 1.95

sum_price = b_price + c_price

sum = sum_price * percentage / 100

print(f'{abs(sum - sum_price):.2f}')
