# •	Пакет химикали - 5.80 лв
# •	Пакет маркери - 7.20 лв
# •	Препарат - 1.20 лв (за литър)
# Вход
# От конзолата се четат 4 числа:
# •	Първи ред - брой пакети химикали. Цяло число в интервала [0...100]
# •	Втори ред - брой пакети маркери. Цяло число в интервала [0...100]
# •	Трети ред - литър препарат за почистване на дъска. Реално число в интервала [0.00…50.00]
# •	Четвърти ред - процентът намаление. Цяло число в интервала [0...100]

p_count = float(input())
m_count = float(input())
d_count = float(input())
discount = float(input())

p_price = p_count * 5.80
m_price = m_count * 7.20
d_price = d_count * 1.20
result = p_price + m_price + d_price
price_discount = result * discount / 100
print(f'{result - price_discount:.3f}')
