# Бабата на Деси всяка година приготвя обяд за семейството си за Великден. Напишете програма, която изчислява какви разходи ще има по приготвянето на обяда, като знаете колко броя козунаци, кори с яйца и килограма курабии е купила.  Цените на продуктите са следните:
# •	Козунак  – 3.20 лв.
# •	Яйца –  4.35 лв. за кора с 12 яйца
# •	Курабии – 5.40 лв. за килограм
# •	Боя за яйца - 0.15 лв. за яйце
# Вход
# От конзолата се четат 3 реда:
# •	Брой козунаци - цяло число в интервала [0 … 99]
# •	Брой кори с яйца - цяло число в интервала [0 … 99]
# •	Килограми курабии - цяло число в интервала [0 … 99]

count_kozunak = int(input())
count_box_eggs = int(input())
count_kurabii = int(input())

price_kozunak = count_kozunak * 3.2
price_eggs = count_box_eggs * 4.35
price_kurabii = count_kurabii * 5.40
price_paint = (count_box_eggs * 12) * 0.15
sum = price_kozunak + price_eggs + price_kurabii + price_paint

print(f'{sum:.2f}')
